# SheetId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Viewport..::..SheetId Property
Viewport Class See Also
---
The element id of the ViewSheet on which the viewport appears, or InvalidElementId if this viewport does not associate a view with placement onto a sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId SheetId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SheetId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SheetId {
	ElementId^ get ();
}
```

# See Also
Viewport Class
Autodesk.Revit.DB Namespace